"""
Файл - для общей замены сообщений в боте
"""

INCORRECT_INPUT = 'Ошибка ввода! Данной команды не существует!'
WELCOME = '✋ Привет!\n\n' \
          '⚙ Настраиваем профиль!\n\n' \
          'Шаг 1 из 2. Анкеты какого пола показывать?'

SEARCH_AGE = '✌️ Отлично\n\n'\
          '⚙ Настраиваем профиль!\n\n' \
          'Шаг 2 из 2. Анкеты какого возраста показывать?\n\n' \
             'Отметье ✅ нужные возраста и нажмите ➡️ Далее'
edit_reg_step_one_search = 'Анкеты какого пола показывать?'
edit_reg_step_too_search = 'Анкеты какого возраста показывать?\n\n' \
             'Отметье ✅ нужные возраста и нажмите ➡️ Далее'

edit_reg_step_one = 'Выберите ваш пол?'
edit_reg_step_two = 'Как вас зовут?\n\n' \
               'Напишите русскими буквами. <b>Например, Максим</b>'
edit_reg_step_three = 'Сколько вам лет?\n\n' \
                 'Напишите число. <b>Например, 24</b>'
edit_reg_step_four = 'Отправьте вашу фотографию\n\n' \
               'Фото проходит модерацию'
edit_reg_step_five = 'Шаг 5 из 5. Как с вами связаться? Напишите любой ваш контакт.\n' \
                'Например, номер телефона или ник в Telegram/Instagram.\n' \

reg_step_one = 'Шаг 1 из 5. Выберите ваш пол?'
reg_step_too = 'Шаг 2 из 5. Как вас зовут?\n\n' \
               'Напишите русскими буквами. <b>Например, Максим</b>'
reg_step_three = 'Шаг 3 из 5. Сколько вам лет?\n\n' \
                 'Напишите число. <b>Например, 24</b>'
reg_step_foo = 'Шаг 4 из 5. Отправьте вашу фотографию\n\n' \
               'Фото проходит модерацию'
reg_step_fife = 'Шаг 5 из 5. Как с вами связаться? Напишите любой ваш контакт.\n' \
                'Например, номер телефона или ник в Telegram/Instagram.\n'

itog_reg = 'Отличные новости — регистрация пройдена!\n\n' \
           'Нажмите кнопку "Меню" в левом нижнем углу:\n\n' \
           '🌟 Начать раунд — здесь выбирать анкеты и отправлять симпатии\n\n' \
           '❤️ Входящие лайки — анкеты людей, кому вы понравились\n\n' \
           '⚙️ Настройки — изменить свою анкету или настройки поиска'

rounds = 'Выбор {} из {}\n\n' \
         '{} или {}?'

itog_round = '🎉 <b>Ура! Подводим итоги {} раунда:</b>\n\n' \
             '👑 {} - победитель раунда! {}\n\n' \

sympathy = '❤️❤️❤️ Лайки отправлены. У вас отличный вкус!\n\n' \
           'Чтобы получить входящие лайки, нужно заполнить анкету: 5 шагов и не больше 60 секунд.\n\n' \
           'Вперед за лайками и свиданием 😍'


itog_round_reg = '{} - {}\n\n' \


itog_round_no_prem = 'Доступно раундов - {}. Счетчик раундов обновится через {} часов.' \

itog_round_no_prem_round_1 = 'Доступно еще раундов - {}'

itog_round_prem = '{} отправлены симпатии ❤️❤️❤️\n\n'


premium = 'Что дает премиум?\n\n' \
          '💪 Неограниченное количество раундов\n\n' \
          '❤ Открывает все входящие лайки\n\n' \
          '👀 Показывает ваш профиль чаще других\n\n' \
          'Стоимость премиума 100 руб. навсегда.\n\n' \

settings = 'Параметры поиска:\n' \
           '1️⃣Пол: {}\n' \
           '2️⃣Поисковой Возраст: {}\n\n' \
           'Мои данные:\n' \
           '3️⃣Мой пол: {}\n' \
           '4️⃣Имя: {}\n' \
           '5️⃣Мой возраст: {}\n' \
           '6️⃣Способ связи: {}\n' \
           '7️⃣Фото \n\n' \
           'Статус премиума:\n' \
           '8️⃣Премиум: {} \n\n' \
           '✅Что меняем?' \

showing_profiles_prem = 'Имя: {}\n' \
                   'Возраст: {}\n' \
                   'Контакт: {}'


choice_round = '👑 Выбор раунда\n\n'


emp_simp = '❤ Взаимная симпатия\n\n'

showing_profiles_mutual = 'Имя: {}\n' \
                          'Возраст: {}\n' \
                          'Контакт: {}'

no_incoming_likes = 'Здесь будут люди, выбравшие вас в раундах.\n\n' \
                    'Совсем скоро.'

incoming_likes = 'Вас выбрали! Узнайте кто в разделе "❤ Входящие лайки"'


king_round = 'Вааау! Вас выбрали чаще остальных в раунде! Узнайте кто в разделе "❤ Входящие лайки"'


mutual_likes = 'Это взаимно! Ваши выборы сошлись! Узнайте с кем в разделе "❤ Входящие лайки"'


blok_anket = 'Ваша анкета заблокирована. Причина: Загрузите фотографию, где отчетливо видно ваше лицо и нет недопустимого содержания.'


full_block_anket = 'Ваша анкета заблокирована.'


buy_prem = 'Есть 2 способа смотреть входящие лайки:\n\n' \
           '1. Бесплатно. Когда человек выбирает вас, а вы выбрали этого человека - ваши профили открываются друг для друга. Взаимная симпатия 😚\n\n' \
           '2. Премиум. Вам не нужно выбирать. Вы будете всегда видеть все входящие лайки.' \
           'Цена - 100 руб. навсегда'

incorrect_range_age = 'Неверный диапазон! Введите число в диапазоне 18 - 99'

incorrect_age = 'Должно быть число! Введите число в диапазоне 18 - 99'

by_title_prem = 'Покупка премиума'

by_desc_prem = 'Хотите оформить подписку?'

text_main = '✋ Добро пожаловать в next! Москва'

new_anket = 'А вы скоро!? У нас новые анкеты ❤ '

end_anket = '😮 Анкеты закончились. Подождите совсем чуть-чуть! Мы пришлем сообщение, когда появятся новые ⏳'

choice_round_push = '👑 Вас выбрали чаще остальных в раунде'

choice_telegram = 'Напишите ваш логин или телефон в Telegram'

choice_instagram = 'Напишите ваш логин в Instagram'

choice_whatsapp = 'Напишите ваш номер в Whatsapp'

choice_other = 'Напишите любой способ связи с вами'

update_round = '❤️ Та самая анкет ждет!\nПереходите в Новый раунд 🌟'

first_no_reg = '❤️ Вы — великолепны!\n👍 Пора получать лайки\n🏆 Просто завершите регистрацию'

second_no_reg = '🥰 Лайки и встречи ждут!\n😇 Подарите возможность познакомиться с вами\n🏆 Завершите регистрацию'

third_no_reg = '😮 Вау!\n🤗 С вами хотят познакомиться\n🏆 Завершите быструю регистрацию'


NO_REG_LIST = [first_no_reg, second_no_reg, third_no_reg]
